[
  {
    "type": "list_hero",
    "content": [
      {
        "title": "Janus Indexer",
        "text": "<p>We present Janus Indexer, a Ethereum Blockchain tool that will upload your content on the decentralized Web 3.0</p><p><em>The future is here</em></p>",
        "image": ""
      }
    ]
  },
  {
    "type": "list_paragraph",
    "content": [
      {
        "title": "How to use the Indexer?",
        "text": "<p>To get started on the Janus Indexer platform, you will need to follow some procedures.</p><h3 id='the-content-to-be-indexed'>The content to be indexed</h3><p>To upload a content you will need to:</p><ul><li>Have all your files inside a folder</li><li>Have an index.html in the root folder</li><li>Define the tags on your index.html</li><li>Compress this folder with .zip extension</li></ul><p>So first, let me example a static website that will be indexed, we need to have the files on a folder as the image above:</p><p><img src='./static/images/folder-print.png' alt='folder opened' title='folder'></p><p>As we can see we have some files inside a folder and the most important file is the index.html that contains the tags to be referenced on the Janus Search. For the Index.html tags we have three meta types:</p><ul><li>Title: The title of your website that will appear on the Search result</li><li>Description:  An brief description of your website</li><li>Keywords: The words to be referenced on the search</li></ul><p>See an example of index.html on the website we used as template:</p><p><pre>&lt;head&gt;<br/>&lt;title&gt;Website Template&lt;/title&gt;<br/>&lt;meta http-equiv='Content-Type'  content='text/html; charset=UTF-8'&gt;<br/>&lt;meta name='description' content='This is a template website. Here you will find an HTML example code'&gt;<br/>&lt;meta name='keywords' content='html, example, test, website'&gt;<br/>&lt;meta  name='viewport'  content='width=device-width, initial-scale=1'&gt;<br/>&lt;link rel='stylesheet'  href='./style.css'&gt;<br/>&lt;/head&gt;<br/></pre></p><p>Now that we have our content, we need to compress this folder as a .zip. After that, login with Metamask on our application</p><h3 id='login-with-metamask'>Login with Metamask</h3><p>If you don’t have the metamask installed on your computer, go to this URL and install on your preferred browser<br /><br /><a href='https://metamask.io/'>https://metamask.io</a></p><p>After install, click on the user button and login with your metamask account. A window will appear to you accept the connection with metamask, please confirm this action so you can use our platform. After this, you are ready to index content on our indexer</p><h3 id='index-content'>Index Content</h3><p>Go to /indexer page and select your compressed folder<br>Click on the index content button and confirm the transaction on this window<br>When you see a green notification you can check your metamask recent transaction to see if there is a success status, if it is, your content can be searched on the Janus Search</p>"
      }
    ]
  }
]